tutorials/myLusgsFoam/SE1050/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-10;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 32;
    }
    outlet
    {
        type            zeroGradient;
    }
    blade
    {
        type            fixedValue;//kLowReWallFunction;
        value           uniform 1e-10;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    period1
    {
        type            cyclic;
    }
    period2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
